% Первая сторона
N11=14000;
N12=13000;
% Вторая сторона
N21=14000;
N22=15000;
 
[t,YYYY]=ode45('forwar3',[0 30],[N11 N12 N21 N22]);
M = numel(t,YYYY)/4;
N=4;
X=[YYYY];
for j=1:1:N
for i=2:1:M
     if X(i,j)<0;
         X(i,j)=0;
    end
     if X(i-1,j)==0;
         X(i,j)=0;
     end
 end
end
DM=zeros(M,2);
for i=1:1:M
      DM(i,1)=X(i,1)+X(i,2);
      DM(i,2)=X(i,3)+X(i,4);
end
figure    
plot(t,X(:,1),t, X(:,2),t, X(:,3),t, X(:,4)),grid on %изменение во времени численностей каждой из армий 
xlabel('время')
ylabel('численности армий каждой из воюющих стран ')
legend('1-я сторона 1-я армия', '1-я сторона 2-я армия', '2-я сторона 1-я армия', '2-я сторона 2-я армия')

figure 
plot(t,DM(:,1),t,DM(:,2)),grid on %изменение во времени численности армий союзников 
xlabel('время')
ylabel('численность армий союзников')
legend('1-я сторона', '2-я сторона')

figure 
plot(DM(:,1),DM(:,2)),grid on
xlabel('численность первой армии.')
ylabel('численность второй армии.')